def c_get_hello(full_name: str) -> str:
    return f"Привіт, {full_name}!\nВи новачок у нас, " "тому введіть свої дані."


def c_get_hello_back(first_name: str, last_name: str) -> str:
    return f"{first_name} {last_name} ми раді бачити вас знову!"


c_register = "Реєстрація 📝"
c_cancel = "Відмовитись ❌"
c_share_phone_number = "Надіслати номер телефону"
c_input_phone_number = "Введіть свій номер телефону:"
c_input_first_name = "Введіть ім'я:"
c_input_last_name = "Введіть своє прізвище:"
c_input_password = "Введіть пароль:"
c_input_password_again = (
    "Будь ласка, введіть ще раз:\n" "(<i>Пароль має бути не менше 4 символів</i>)"
)
c_successfully_register = "Вітаю 🎉\n" "<b>Ви успішно зареєструвалися.</b>"
c_registeration_failed = "Під час реєстрації сталася помилка 🫤\n"

c_about_us = "Про нас 👁️"
